# GetSortGroupField Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetSortGroupField Method
ScheduleDefinition Class See Also
---
Gets a sorting/grouping field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleSortGroupField GetSortGroupField(
	int index
)
```

Visual Basic
---
```text
Public Function GetSortGroupField ( _
	index As Integer _
) As ScheduleSortGroupField
```

Visual C++
---
```text
public:
ScheduleSortGroupField^ GetSortGroupField(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the sorting/grouping field.
# ### Return Value
A copy of the sorting/grouping field.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is not a valid sorting/grouping field index. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace